In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('tb.xlsx', sheet_name=None)

In [3]:
df.keys()

odict_keys(['tb_balances', 'tb_desc', 'fs_groupings'])

In [4]:
df_bal = df['tb_balances']
df_desc = df['tb_desc']
df_group = df['fs_groupings']

In [5]:
df_bal.head()

   Account  Balance
0     1000    79256
1     1010    24498
2     1020   -54289
3     1030    76519
4     1040   -12535

In [6]:
df_desc.head()

   Account                            Description
0     1000                             Petty Cash
1     1010  Cash on Hand (e.g. in cash registers)
2     1020               Regular Checking Account
3     1030               Payroll Checking Account
4     1040                        Savings Account

In [7]:
df_group.head()

   Account Financial Statement Grouping
0     1000    Cash and cash equivalents
1     1010    Cash and cash equivalents
2     1020    Cash and cash equivalents
3     1030    Cash and cash equivalents
4     1040    Cash and cash equivalents

In [18]:
df_bal.merge(df_desc, on='Account').merge(df_group, on='Account')

,Account,Balance,Description,Financial Statement Grouping
0,1000,79256,Petty Cash,Cash and cash equivalents
1,1010,24498,Cash on Hand (e.g. in cash registers),Cash and cash equivalents
2,1020,-54289,Regular Checking Account,Cash and cash equivalents
3,1030,76519,Payroll Checking Account,Cash and cash equivalents
4,1040,-12535,Savings Account,Cash and cash equivalents
...,...,...,...,...
135,7700,-59027,"Salaries Expense, Officers",Operating costs
136,7750,-33353,Wages Expense,Operating costs
137,7800,-63677,Utilities Expense,Operating costs
138,8900,-65432,Other Expense,Operating costs
139,9000,87798,Gain/Loss on Sale of Assets,Operating costs